In [19]:
## packages, libraries, framework 

import pandas as pd


data = {
    "names": ["sam", "jam", "ram"],
    "numbers": [3,5,2],
    "fax": [1231231,3253453,3453456],
}

dataframe = pd.DataFrame(data)

print(dataframe)
print(type(dataframe))

  names  numbers      fax
0   sam        3  1231231
1   jam        5  3253453
2   ram        2  3453456
<class 'pandas.DataFrame'>

In [20]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      str
 1   numbers  3 non-null      int64
 2   fax      3 non-null      int64
dtypes: int64(2), str(1)
memory usage: 204.0 bytes

In [21]:
dataframe.describe()

        numbers           fax
count  3.000000  3.000000e+00
mean   3.333333  2.646047e+06
std    1.527525  1.229340e+06
min    2.000000  1.231231e+06
25%    2.500000  2.242342e+06
50%    3.000000  3.253453e+06
75%    4.000000  3.353454e+06
max    5.000000  3.453456e+06

In [22]:
dataframe.columns

Index(['names', 'numbers', 'fax'], dtype='str')

In [31]:
#dataframe.corr('numbers', 'fax')
num = dataframe['numbers']
fa = dataframe['fax']

In [32]:
num

0    3
1    5
2    2
Name: numbers, dtype: int64

In [33]:
fa

0    1231231
1    3253453
2    3453456
Name: fax, dtype: int64

In [37]:
correlation = num.corr(fa)

In [38]:
print(correlation)

0.10847609288637718

In [45]:
data = {
    "time": [44,33,22,55,66,77],
    "running": [3,4,5,7,8,7],
    "calories": [544,433,222,777,888,999],
    "address": ['123 some address', "someer", "sfdsfsf", "asdasdsdads", "werwwe f ", "3434 sdfs df s"]
}

In [46]:
df = pd.DataFrame(data)

In [58]:
df

   time  running  calories           address
0    44        3       544  123 some address
1    33        4       433            someer
2    22        5       222           sfdsfsf
3    55        7       777       asdasdsdads
4    66        8       888         werwwe f
5    77        7       999    3434 sdfs df s

In [59]:
df.corr(numeric_only=True)

              time   running  calories
time      1.000000  0.706758  0.992655
running   0.706758  1.000000  0.730202
calories  0.992655  0.730202  1.000000

In [52]:
var = df['time'].corr(df['running'])

In [53]:
var

np.float64(0.706758366885431)

In [54]:
data_corr = df[['time','running','calories']]

In [55]:
data_corr

   time  running  calories
0    44        3       544
1    33        4       433
2    22        5       222
3    55        7       777
4    66        8       888
5    77        7       999

In [56]:
data_corr.corr()

              time   running  calories
time      1.000000  0.706758  0.992655
running   0.706758  1.000000  0.730202
calories  0.992655  0.730202  1.000000

In [61]:
df = pd.read_csv("tested.csv")

In [62]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [63]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [65]:
df.corr(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.023245,-0.026751,-0.034102,0.003818,0.043080,0.008211
Survived,-0.023245,1.000000,-0.108615,-0.000013,0.099943,0.159120,0.191514
Pclass,-0.026751,-0.108615,1.000000,-0.492143,0.001087,0.018721,-0.577147
Age,-0.034102,-0.000013,-0.492143,1.000000,-0.091587,-0.061249,0.337932
SibSp,0.003818,0.099943,0.001087,-0.091587,1.000000,0.306895,0.171539
Parch,0.043080,0.159120,0.018721,-0.061249,0.306895,1.000000,0.230046
Fare,0.008211,0.191514,-0.577147,0.337932,0.171539,0.230046,1.000000

In [96]:
input_column = df['Sex']

In [97]:
input_column

0        male
1      female
2        male
3        male
4      female
        ...
413      male
414    female
415      male
416      male
417      male
Name: Sex, Length: 418, dtype: str

In [79]:
input_columns

        Sex                                          Name
0      male                              Kelly, Mr. James
1    female              Wilkes, Mrs. James (Ellen Needs)
2      male                     Myles, Mr. Thomas Francis
3      male                              Wirz, Mr. Albert
4    female  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..      ...                                           ...
413    male                            Spector, Mr. Woolf
414  female                  Oliva y Ocana, Dona. Fermina
415    male                  Saether, Mr. Simon Sivertsen
416    male                           Ware, Mr. Frederick
417    male                      Peter, Master. Michael J

[418 rows x 2 columns]

In [82]:
output_columns = df[['Survived']]

In [84]:
output_columnss = df['Survived']

In [87]:
type(output_columns)

pandas.DataFrame

In [86]:
type(output_columnss)

pandas.Series

In [69]:
input_columns

        Sex                                          Name
0      male                              Kelly, Mr. James
1    female              Wilkes, Mrs. James (Ellen Needs)
2      male                     Myles, Mr. Thomas Francis
3      male                              Wirz, Mr. Albert
4    female  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..      ...                                           ...
413    male                            Spector, Mr. Woolf
414  female                  Oliva y Ocana, Dona. Fermina
415    male                  Saether, Mr. Simon Sivertsen
416    male                           Ware, Mr. Frederick
417    male                      Peter, Master. Michael J

[418 rows x 2 columns]

In [72]:
numberic_sex_column = pd.to_numeric(df['Sex'])

ValueError: Unable to parse string "male" at position 0

In [99]:
name = pd.get_dummies(input_column, dtype = int)

In [103]:
name

     female  male
0         0     1
1         1     0
2         0     1
3         0     1
4         1     0
..      ...   ...
413       0     1
414       1     0
415       0     1
416       0     1
417       0     1

[418 rows x 2 columns]

In [117]:
corr_columns = pd.DataFrame([df['Survived'], name['female'], name['male']])

In [119]:
type(corr_columns)

pandas.DataFrame

In [120]:
corr_columns.corr()

,0,1,2,3,4,5,6,7,8,9,...,408,409,410,411,412,413,414,415,416,417
0,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
1,-1.0,1.0,-1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,...,1.0,1.0,1.0,1.0,1.0,-1.0,1.0,-1.0,-1.0,-1.0
2,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
3,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
4,-1.0,1.0,-1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,...,1.0,1.0,1.0,1.0,1.0,-1.0,1.0,-1.0,-1.0,-1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
414,-1.0,1.0,-1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,...,1.0,1.0,1.0,1.0,1.0,-1.0,1.0,-1.0,-1.0,-1.0
415,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
416,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0
417,1.0,-1.0,1.0,1.0,-1.0,1.0,-1.0,1.0,-1.0,1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,1.0,-1.0,1.0,1.0,1.0

In [121]:
corr_columns = [df['Survived'], name['female'], name['male']]